<a href="https://colab.research.google.com/github/Ghalia671/MODULE1/blob/master/Kezhan_1_0_manipulation_de_data_frame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Description et dimensions

importer les donn√©es

In [ ]:
import pandas as pd
import numpy as np

url = "http://dataks.bitbucket.io/titanic/titanic.csv"
df = pd.read_csv(url,sep=";")

df.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   object
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   object
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(5), object(9)
memory usage: 143.4+ KB

In [ ]:
df = pd.read_csv(url, delimiter=";", decimal=",")

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [ ]:

print("Dimensions: {}".format(df.shape))

Dimensions: (1310, 14)

R√©sum√© statistique des variables num√©riques

In [ ]:
df.describe()

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

# S√©lection de colonnes

## Avec les indices

In [ ]:
print(df.iloc[:,3].values[0:10])

## Avec les noms des colonnes

In [ ]:
print(df.sex[0:10])

In [ ]:
print(df.sex.values[0:10])

## Avec les types de variables

In [ ]:
df.info()

In [ ]:
print(df.select_dtypes(include=['float64']).values[:10,])

# S√©lection de lignes

## Avec les indices

avec `iloc`, on peut s√©lectionner les lignes avec les num√©ros de lignes.

In [ ]:
df.iloc[0]

In [ ]:
df.iloc[[0,1,2]]

On peut aussi supprimer certaines lignes.

In [ ]:
display(df.drop([0,1,2], axis=0).head())

On peut pr√©ciser aussi des intervalles pour s√©lectionner les lignes.

In [ ]:
display(df[100:].head())

In [ ]:
display(df[-10:].head())

In [ ]:
df.iloc[:4]

## Avec une colonne `index`

On peut utiliser une colonne comme `index` pour ensuite s√©lectionner les lignes avec les valeurs de cette colonne.

In [ ]:

df = df.set_index(df['name'])

In [ ]:
df.head()

In [ ]:
df.loc['Allen, Miss. Elisabeth Walton']

## Avec des conditions

In [ ]:
display(df[df.age>25].head())

In [ ]:
df[df['sex'] == 'female'].head(5)

In [ ]:

df[(df['sex'] == 'female') & (df['age'] >= 65)]

# Manipulation des valeurs des variables

## Remplacer des valeurs

In [ ]:

df['sex'].replace('female', 'Woman').head(2)

In [ ]:

df['sex'].replace(['female', 'male'], ['Woman', 'Man']).head(5)

In [ ]:
df.head()

## Analyse statistique

In [ ]:
print('Maximum: {}'.format(df['age'].max()))
print('Minimum: {}'.format(df['age'].min()))
print('Mean: {}'.format(df['age'].mean()))
print('Sum: {}'.format(df['age'].sum()))
print('Count: {}'.format(df['age'].count()))

In [ ]:
print("Variance: {}".format(df.var()))
print("Standard Deviation: {}".format(df.std()))
print("Kurtosis: {}".format(df.kurt()))
print("Skewness: {}".format(df.skew()))

## Comptage des cat√©gories

In [ ]:

df['sex'].unique()

In [ ]:

df['sex'].value_counts()

## Donn√©es manquantes

In [ ]:
df[df['age'].isnull()].head(2)

# Op√©ration sur les colonnes

## Renommer les colonnes

In [ ]:
df.rename(columns={'PClass': 'Passenger Class'}).head(2)

In [ ]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

## Supprimer des colonnes

In [ ]:
# axis=1 means the column axis
df.drop('age', axis=1).head(2)

# Op√©ration sur les lignes

## Supprimer des lignes

In [ ]:

df[df['sex'] != 'male'].head(2)

In [ ]:

df[df['name'] != 'Allison, Miss Helen Loraine'].head(2)

In [ ]:

df[df.index != 0].head(2)

## Regroupement des lignes

In [ ]:
df.groupby('sex').mean()

In [ ]:
df.groupby('survived')['name'].count()

In [ ]:
df.groupby(['sex', 'survived'])['age'].mean()

On peut utiliser `apply` pour appliquer des fonctions sp√©cifiques.

In [ ]:
df.groupby('sex').apply(lambda x: x.count())

En combinant `groupby` et `apply` on peut appliquer des fonctions √† des groupes sp√©cifiques.

In [ ]:
df.groupby(['sex','pclass']).agg({'age':np.mean,'sibsp':np.max})

In [ ]:
df.groupby(['sex','pclass']).agg({'fare':[np.sum,np.mean]})

## Tables crois√©es

In [ ]:
df.head()

In [ ]:
display(df.pivot_table(index='survived', columns='sex', 
                         values='age',aggfunc=np.mean))